Infineon/mtb-example-psoc-edge-btstack-wifi-onboarding/proj_cm33_ns/main.c
        if (false == attr_handle)
            break;

        if (NULL ==(puAttribute = app_get_attribute(attr_handle)))
        {
            wiced_bt_gatt_server_send_error_rsp(conn_id, opcode,
                    p_read_data->s_handle, WICED_BT_GATT_ERR_UNLIKELY);
            wiced_bt_free_buffer(p_rsp);
            return WICED_BT_GATT_ERR_UNLIKELY;
        }

        len_filled = wiced_bt_gatt_put_read_by_type_rsp_in_stream(
                p_rsp + to_track_len_requested, len_requested - to_track_len_requested, &pair_len, attr_handle,
                 puAttribute->cur_len, puAttribute->p_data);
        if (INITIAL_LEN_FILLED == len_filled)
        {
            break;
        }
        to_track_len_requested += len_filled;

        /* Increment starting handle for next search to one past current */
        attr_handle++;
    }

    if (INITIAL_LEN_FILLED == to_track_len_requested)
    {
        wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, p_read_data->s_handle,
                                            WICED_BT_GATT_INVALID_HANDLE);
        wiced_bt_free_buffer(p_rsp);
        return WICED_BT_GATT_INVALID_HANDLE;
    }

    /* Send the response */
    wiced_bt_gatt_server_send_read_by_type_rsp(conn_id, opcode, pair_len,
            to_track_len_requested, p_rsp, (wiced_bt_gatt_app_context_t)wiced_bt_free_buffer);

    return WICED_BT_GATT_SUCCESS;
}

/*******************************************************************************
* Function Name: app_gatts_req_write_handler
********************************************************************************
* Summary:
* This function handles the GATT write request events from the stack
*
* Parameters:
*  uint16_t conn_id: Connection ID
*  wiced_bt_gatt_opcode_t opcode: GATT opcode
*  wiced_bt_gatt_write_t * p_data: Write data structure
*
* Return:
*  wiced_bt_gatt_status_t: GATT result
*
*******************************************************************************/
wiced_bt_gatt_status_t app_gatts_req_write_handler(uint16_t conn_id,
                                                   wiced_bt_gatt_opcode_t opcode,
                                                   wiced_bt_gatt_write_req_t *p_data)
{
    wiced_bt_gatt_status_t result = WICED_BT_GATT_SUCCESS;
    uint8_t *p_attr = p_data->p_val;
    gatt_db_lookup_table_t *puAttribute;

    /* Return status for NVM. */
    cy_rslt_t nvm_result;

    /* Variables for TLV data extraction */
    uint8_t byte_no = 0;
    uint8_t data_length = 0;

    printf("GATT write handler: handle:0x%X len:%d, opcode:0x%X\n",
           p_data->handle, p_data->val_len, opcode);

    /* Get the right address for the handle in Gatt DB */
    if (NULL == (puAttribute = app_get_attribute(p_data->handle)))
    {
        printf("\nWrite Handle attr not found. Handle:0x%X\n", p_data->handle);
        return WICED_BT_GATT_INVALID_HANDLE;
    }

    switch (p_data->handle)
    {
        /* Write request for the WiFi SSID characteristic. Copy the incoming data
        to the WIFI SSID variable */
        case HDLC_CUSTOM_SERVICE_WIFI_SSID_VALUE:

            /* First copy the value to the GATT DB variable and then to the global
             * variable to be stored in NV memory
             */
            memset(app_custom_service_wifi_ssid, CRED_INIT_VALUE,
                   strlen((char *)app_custom_service_wifi_ssid));
            memcpy(app_custom_service_wifi_ssid, p_attr, p_data->val_len);
            puAttribute->cur_len = p_data->val_len;

            memcpy(&wifi_details.wifi_ssid[0], p_attr, p_data->val_len);
            wifi_details.ssid_len = p_data->val_len;

            printf("Wi-Fi SSID: %s\n", app_custom_service_wifi_ssid);
            break;

        /* Write request for the WiFi password characteristic. Accept the password.
        Copy the incoming data to the WIFI Password variable */
        case HDLC_CUSTOM_SERVICE_WIFI_PASSWORD_VALUE:

            /* First copy the value to the GATT DB variable and then to the global
             * variable to be stored in NV memory
             */
            memset(app_custom_service_wifi_password, CRED_INIT_VALUE,
                    strlen((char *)app_custom_service_wifi_password));
            memcpy(app_custom_service_wifi_password, p_attr, p_data->val_len);
            puAttribute->cur_len = p_data->val_len;

            memcpy(&wifi_details.wifi_password[0], p_attr, p_data->val_len);
            wifi_details.password_len = p_data->val_len;

            printf("Wi-Fi Password: %s\n", app_custom_service_wifi_password);
            break;

        /* Write request for the WiFi SSID and password characteristic. Accept the
        values and Copy the incoming data to the WIFI SSID Password variable */
        case HDLC_CUSTOM_SERVICE_WIFI_SSID_PASSWORD_VALUE:

            /* Extract the value from the received data */
            for(byte_no = 0; byte_no < p_data->val_len;)
            {
                /* Check if the Type is SSID packet type */
                if(DATA_PACKET_TYPE_SSID == p_attr[byte_no])
                {
                    /* Extract the length of the data */
                    data_length =  p_attr[++byte_no];

                    /* Copy the SSID value based on the length */
                    memcpy(&wifi_details.wifi_ssid[0], &p_attr[++byte_no],
                            data_length);

                    wifi_details.ssid_len = data_length;

                    /* Move the pointer to the address after the SSID value */
                    byte_no = byte_no + data_length;

                }
                /* Check if the Type is password packet type */
                else if(DATA_PACKET_TYPE_PASSWORD == p_attr[byte_no])
                {
                    /* Extract the length of the data */
                    data_length = p_attr[++byte_no];

                    /* Copy the password value based on the length */
                    memcpy(&wifi_details.wifi_password[0], &p_attr[++byte_no],
                            data_length);

                    wifi_details.password_len = data_length;

