Infineon/mtb-example-psoc-edge-btstack-wifi-onboarding/proj_cm33_ns/main.c
                    /* Move the pointer to the end of the packet. No more data
                     * expected
                     */
                    byte_no = byte_no + data_length;
                }
            }

            printf("Wi-Fi SSID: %s\n", wifi_details.wifi_ssid);
            printf("Wi-Fi Password: %s\n", wifi_details.wifi_password);
            break;


        /* Handle the CCCD values for WIFI NETWORKS characteristic */
        case HDLD_CUSTOM_SERVICE_WIFI_NETWORKS_CLIENT_CHAR_CONFIG:
            app_custom_service_wifi_networks_client_char_config[0] = p_attr[0];
            app_custom_service_wifi_networks_client_char_config[1] = p_attr[1];
            break;

        /* Write request for the control characteristic. Copy the incoming data
        to the WIFI control variable. Based on the value, start connect, disconnect
         or scan procedure */
        case HDLC_CUSTOM_SERVICE_WIFI_CONTROL_VALUE:
            app_custom_service_wifi_control[0] = p_attr[0];
            puAttribute->cur_len = p_data->val_len;

            /* Connect command */
            if (WIFI_CONTROL_CONNECT == app_custom_service_wifi_control[0])
            {
                if(0 != wifi_details.ssid_len)
                {
                    /* Set the WiFi Connection parameters structure to 0 before copying
                     * data */
                    memset(&wifi_conn_param, CRED_INIT_VALUE, sizeof(cy_wcm_connect_params_t));

                    /* Copy the WiFi credentials to the global variable */
                    memcpy(wifi_conn_param.ap_credentials.SSID,
                           &wifi_details.wifi_ssid[0], wifi_details.ssid_len);

                    memcpy(wifi_conn_param.ap_credentials.password,
                           &wifi_details.wifi_password[0], wifi_details.password_len);

                    /* Write data to NVM. */

                    nvm_result =  Cy_RRAM_WriteByteArray(RRAMC0,
                            APP_RRAM_NVM_MAIN_NS_START ,
                            &wifi_details.wifi_ssid[0],sizeof(wifi_details) );
                    if (CY_RRAM_SUCCESS != nvm_result)
                    {
                        printf("Failed to write to NVM \n");
                    }

                    /* Send notification to the WiFi task to scan and connect with
                     * the given WiFi credentials
                     */
                    xTaskNotify(wifi_task_handle, (NOTIF_SCAN | NOTIF_CONNECT),
                                eSetValueWithOverwrite);
                }
                else
                {
                    printf("WiFi Credentials not present\n");
                }
            }
            /* Scan command */
            else if(WIFI_CONTROL_SCAN == app_custom_service_wifi_control[0])
            {
                /* Check if notifications are enabled or not. If not then there is
                 * no point of starting the scan. If GATT notification is enabled
                 * then ask the WiFi task to start WiFi scan
                 */
                if ((false != conn_id) &&
                    (app_custom_service_wifi_networks_client_char_config[0] &
                    GATT_CLIENT_CONFIG_NOTIFICATION))
                {
                    xTaskNotify(wifi_task_handle, (NOTIF_SCAN), eSetValueWithOverwrite);
                }
                else
                {
                    printf("Notifications for WiFi Networks characteristic are "
                            "disabled. Cannot scan for networks\n");
                }
            }
            /* Disconnect command */
            else if(WIFI_CONTROL_DISCONNECT == app_custom_service_wifi_control[0])
            {
                xTaskNotify(wifi_task_handle, NOTIF_DISCONNECT,
                            eSetValueWithOverwrite);
            }
            else
            {
                printf("Invalid command\n");
            }
            break;

        /* Notification for control characteristic.
         */
        case HDLD_CUSTOM_SERVICE_WIFI_CONTROL_CLIENT_CHAR_CONFIG:
            app_custom_service_wifi_control_client_char_config[0] = p_attr[0];
            app_custom_service_wifi_control_client_char_config[1] = p_attr[1];
            break;

        default:
            printf("Write GATT Handle not found\n");
            result = WICED_BT_GATT_INVALID_HANDLE;
            break;
    }

    return result;
}

/*******************************************************************************
* Function Name: app_gatt_connect_handler
********************************************************************************
* Summary:
* This function handles the GATT connect request events from the stack
*
* Parameters:
*  wiced_bt_gatt_connection_status_t *p_conn_status: Connection or disconnection
*
* Return:
*  wiced_bt_gatt_status_t: GATT result
*
*******************************************************************************/
wiced_bt_gatt_status_t app_gatt_connect_handler(
                       wiced_bt_gatt_connection_status_t *p_conn_status)
{
    wiced_bt_gatt_status_t status = WICED_BT_GATT_ERROR;
    wiced_result_t result;

    /* Check whether it is a connect event or disconnect event. If the device
    has been disconnected then restart advertisement */
    if (NULL != p_conn_status)
    {
        if (p_conn_status->connected)
        {
            /* Device got connected */
            printf("\nConnected: Peer BD Address: ");
            print_bd_address(p_conn_status->bd_addr);
            printf("\n");
            conn_id = p_conn_status->conn_id;
        }
        else /* Device got disconnected */
        {
            printf("\nDisconnected: Peer BD Address: ");
            print_bd_address(p_conn_status->bd_addr);
            printf("\n");

            printf("Reason for disconnection: %s\n",
                    get_bt_gatt_disconn_reason_name(p_conn_status->reason));

            conn_id = false;

            result = wiced_bt_ble_set_raw_advertisement_data(CY_BT_ADV_PACKET_DATA_SIZE,
                                                             cy_bt_adv_packet_data);
            if (WICED_SUCCESS != result)
            {
                printf("Set ADV data failed\n");
            }

