Infineon/mtb-example-psoc-edge-btstack-wifi-onboarding/proj_cm33_ns/main.c
    switch (event)
    {
        case BTM_ENABLED_EVT:

            /* Bluetooth is enabled */
            wiced_bt_set_local_bdaddr((uint8_t *)cy_bt_device_address,
                                       BLE_ADDR_PUBLIC);

            /* Read and print the BD address */
            wiced_bt_dev_read_local_addr(bda);
            printf("Local Bluetooth Address: ");
            print_bd_address(bda);
            printf("\n");

            application_init();
            break;

        case BTM_DISABLED_EVT:
            break;
            /* Print passkey to the screen so that the user can enter it. */
        case BTM_PASSKEY_NOTIFICATION_EVT:
            printf( "********************************************************\r\n");
            printf( "Passkey Notification\r\n");
            printf("PassKey: %" PRIu32 "\r\n",
            p_event_data->user_passkey_notification.passkey );
            printf( "***********************************************************\r\n");
            break;

        case BTM_PAIRING_IO_CAPABILITIES_BLE_REQUEST_EVT:
            pairing_io_caps->local_io_cap = BTM_IO_CAPABILITIES_DISPLAY_ONLY;

            pairing_io_caps->oob_data = BTM_OOB_NONE;

            pairing_io_caps->auth_req = BTM_LE_AUTH_REQ_SC;

            pairing_io_caps->max_key_size = MAX_KEY_SIZE;

            pairing_io_caps->init_keys = BTM_LE_KEY_PENC | BTM_LE_KEY_PID |
                                        BTM_LE_KEY_PCSRK | BTM_LE_KEY_LENC;

            pairing_io_caps->resp_keys = BTM_LE_KEY_PENC | BTM_LE_KEY_PID |
                                        BTM_LE_KEY_PCSRK | BTM_LE_KEY_LENC;
            break;

        case BTM_PAIRING_COMPLETE_EVT:
            if (WICED_SUCCESS == p_event_data->
                                pairing_complete.pairing_complete_info.ble.status)
            {
                printf("Pairing Complete: SUCCESS\n");
            }
            else /* Pairing Failed */
            {
                printf("Pairing Complete: FAILED\n");
            }
            break;

        case BTM_PAIRED_DEVICE_LINK_KEYS_UPDATE_EVT:
            /* Paired Device Link Keys update */
            result = WICED_SUCCESS;
            break;

        case BTM_PAIRED_DEVICE_LINK_KEYS_REQUEST_EVT:
            /* Paired Device Link Keys Request */
            result = WICED_BT_ERROR;
            break;

        case BTM_LOCAL_IDENTITY_KEYS_UPDATE_EVT:
            /* Local identity Keys Update */
            result = WICED_SUCCESS;
            break;

        case BTM_LOCAL_IDENTITY_KEYS_REQUEST_EVT:
            /* Local identity Keys Request */
            result = WICED_BT_ERROR;
            break;

        case BTM_ENCRYPTION_STATUS_EVT:
            if (WICED_SUCCESS == p_event_data->encryption_status.result)
            {
                printf("Encryption Status Event: SUCCESS\n");
            }
            else /* Encryption Failed */
            {
                printf("Encryption Status Event: FAILED\n");
            }
            break;

        case BTM_SECURITY_REQUEST_EVT:
            wiced_bt_ble_security_grant(p_event_data->security_request.bd_addr,
                                        WICED_BT_SUCCESS);
            break;

        case BTM_BLE_ADVERT_STATE_CHANGED_EVT:
            printf("\n");
            printf("Advertisement state changed to %s\n", get_bt_advert_mode_name(
                                           p_event_data->ble_advert_state_changed));
            break;

        default:
            break;
        }

    return result;
}
/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
* This is the main function for CM33 CPU
*    1. Initializes the BSP
*    2. Initializes retarget IO for UART debug printing
*    3. Initializes platform configuration
*    4. Initializes BT stack and heap
*    5. Creates WiFi task
*    6. Starts the RTOS scheduler
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;

    /* Initialize the board support package */
    result = cybsp_init() ;

    /* Board initialization failed. Stop program execution */
    if (CY_RSLT_SUCCESS != result)
    {
        handle_app_error();
    }

    /* To avoid compiler warnings. */
    (void) result;

    /* Setup CLIB support library. */
    setup_clib_support();

    /* Setup the LPTimer instance for CM33 CPU. */
    setup_tickless_idle_timer();

    /* Initialize retarget-io middleware */
    init_retarget_io();

    /* \x1b[2J\x1b[;H - ANSI ESC sequence to clear screen */
    printf("\x1b[2J\x1b[;H");
    printf("****************** "
           "PSOC Edge MCU: Wi-Fi Onboarding Using Bluetooth LE"
           "****************** \r\n\n");

    /* Initialize the Bluetooth stack with a callback function and stack
     * configuration structure */
    if (WICED_SUCCESS != wiced_bt_stack_init(app_management_callback,
                                             &cy_bt_cfg_settings))
    {
        printf("Error in initializing the BT stack\n");
        handle_app_error();
    }

    /* Enable CM55. CY_CORTEX_M55_APPL_ADDR must be updated if CM55 memory layout is changed. */
    Cy_SysEnableCM55(MXCM55, CM55_APP_BOOT_ADDR, CM55_BOOT_WAIT_TIME_US);

    /* Enable global interrupts */
    __enable_irq();

    /* Initialize WiFi Tasks */
    result = xTaskCreate(wifi_task, "WiFi-Task", WIFI_TASK_STACK_SIZE, NULL,
                WIFI_TASK_PRIORITY, &wifi_task_handle);

    if( pdPASS == result )
    {
        /* Start the RTOS Scheduler */
        vTaskStartScheduler();

        /* Should never get here. */
        handle_app_error();
    }
    else
    {
        handle_app_error();
    }
}

/* [] END OF FILE */
